
class BDInfo {
  // ৮টি বিভাগ
  static const List<String> divisions = [
    "ঢাকা", "চট্টগ্রাম", "রাজশাহী", "খুলনা",
    "বরিশাল", "সিলেট", "রংপুর", "ময়মনসিংহ"
  ];

  // জেলা (বিভাগ অনুযায়ী)
  static List<String> getDistrictsByDivision(String division) {
    final Map<String, List<String>> data = {
      "ঢাকা": ["ঢাকা", "গাজীপুর", "নারায়ণগঞ্জ", "টাঙ্গাইল", "কিশোরগঞ্জ"],
      "চট্টগ্রাম": ["চট্টগ্রাম", "কক্সবাজার", "রাঙামাটি", "বান্দরবান"],  //'Lakshmipur','Feni',"Chadpur","Nowakhali"
      "রাজশাহী": ["রাজশাহী", "বগুড়া", "পাবনা", "নাটোর"],
      "খুলনা": ["খুলনা", "যশোর", "সাতক্ষীরা", "বাগেরহাট"],
      "বরিশাল": ["বরিশাল", "পটুয়াখালী", "ভোলা"],
      "সিলেট": ["সিলেট", "মৌলভীবাজার", "হবিগঞ্জ"],
      "রংপুর": ["রংপুর", "দিনাজপুর", "কুড়িগ্রাম"],
      "ময়মনসিংহ": ["ময়মনসিংহ", "জামালপুর", "নেত্রকোণা"],
    };
    return data[division] ?? [];
  }

  // উপজেলা (জেলা অনুযায়ী)
  static List<String> getUpazilasByDistrict(String district) {
    final Map<String, List<String>> data = {
      "ঢাকা": ["মিরপুর", "গুলশান", "উত্তরা", "ধানমন্ডি"],
      "গাজীপুর": ["টঙ্গী", "কালিয়াকৈর", "শ্রীপুর"],
      "চট্টগ্রাম": ["হালিশহর", "পাঁচলাইশ", "কর্ণফুলী"],
      "কক্সবাজার": ["কক্সবাজার সদর", "উখিয়া", "টেকনাফ"],
      // আরো চাইলে যোগ করো
    };
    return data[district] ?? ["${district} সদর"];
  }
}